```
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # cloudflare_record._28200265_gpo_ca will be created
  + resource "cloudflare_record" "_28200265_gpo_ca" {
      + allow_overwrite = false
      + content         = "sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "28200265.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record._28264590_gpo_ca will be created
  + resource "cloudflare_record" "_28264590_gpo_ca" {
      + allow_overwrite = false
      + content         = "sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "28264590.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record._dmarc_gpo_ca will be created
  + resource "cloudflare_record" "_dmarc_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=DMARC1; p=none; rua=mailto:dmarc@gpo.ca"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.agmsurvey_gpo_ca will be created
  + resource "cloudflare_record" "agmsurvey_gpo_ca" {
      + allow_overwrite = false
      + content         = "www.surveymonkey.com.opts-slash.r.opts-slash.8X8J6S2.redirect.center"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "agmsurvey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.dev_gpo_ca will be created
  + resource "cloudflare_record" "dev_gpo_ca" {
      + allow_overwrite = false
      + content         = "134.122.120.190"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.dev_secure_gpo_ca will be created
  + resource "cloudflare_record" "dev_secure_gpo_ca" {
      + allow_overwrite = false
      + content         = "134.122.120.190"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev.secure.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.e1_gpo_ca will be created
  + resource "cloudflare_record" "e1_gpo_ca" {
      + allow_overwrite = false
      + content         = "u28264590.wl091.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "e1.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.e2_gpo_ca will be created
  + resource "cloudflare_record" "e2_gpo_ca" {
      + allow_overwrite = false
      + content         = "u28235135.wl136.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "e2.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.e_gpo_ca will be created
  + resource "cloudflare_record" "e_gpo_ca" {
      + allow_overwrite = false
      + content         = "u28200265.wl016.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "e.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.emailing2_gpo_ca will be created
  + resource "cloudflare_record" "emailing2_gpo_ca" {
      + allow_overwrite = false
      + content         = "143.244.200.166"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "emailing2.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.emailing_gpo_ca will be created
  + resource "cloudflare_record" "emailing_gpo_ca" {
      + allow_overwrite = false
      + content         = "sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "emailing.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.facebook_secure_gpo_ca will be created
  + resource "cloudflare_record" "facebook_secure_gpo_ca" {
      + allow_overwrite = false
      + content         = "facebook-domain-verification=ma7wgbljzgdw67csxyip3ce1imh301"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "secure.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.feb2019__domainkey_lists_gpo_ca will be created
  + resource "cloudflare_record" "feb2019__domainkey_lists_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=DKIM1;p=testing123123"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "feb2019._domainkey.lists.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.google__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "google__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "\"v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA7RCyGRi/9IJLNCq4aLbOzZyaTUC4dALTezih8B2AruUzy3+b275/2k/uSRtCR6ZIIq1IV5h1G78s27gbuvNIt8u3JZ1axk/c9RVcshT+vVJHyDRrnu6CMGzCR82Ev7KsJ4aEnCIl5HsxqF3yLY0EH3NoACyS0tt8CzagYhzZMttci2yYZ9iD5v10onEY\" \"xFZf23xhLSqfji0RG88GBiTwVt/YJYPYeP/syPWNIJITC423nBocOTxJ8cxUJV0KasC+nZK68UaUJ6orqoWUM1CylxHxikqGxgRR9NbNdzuN/1AnK+Byf3pcwLHCfIXz9q4P7Hff573dvTNw2tFOeLwpxwIDAQAB\""
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "google._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.google_secure_gpo_ca will be created
  + resource "cloudflare_record" "google_secure_gpo_ca" {
      + allow_overwrite = false
      + content         = "google-site-verification=omPDG1sAStc3PcgGLKiMc9yLmhuL59BvUF0juSdBDxU"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "secure.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.gvote_gpo_ca will be created
  + resource "cloudflare_record" "gvote_gpo_ca" {
      + allow_overwrite = false
      + content         = "159.203.49.157"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gvote.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.gvotedoworkaround_gpo_ca will be created
  + resource "cloudflare_record" "gvotedoworkaround_gpo_ca" {
      + allow_overwrite = false
      + content         = "159.203.49.157"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gvotedoworkaround.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.list_gpo_ca will be created
  + resource "cloudflare_record" "list_gpo_ca" {
      + allow_overwrite = false
      + content         = "google-site-verification=-zgog0QI7kpVmqeRgdKcz5u1M8tTdgB2QRE1Xs-eCJo"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "list.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.mail__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "mail__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=DKIM1; g=*; k=rsa; t=y; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDL/yJ8RTaaLS1iKCySH7L+5XsSdz5uwWZVHjtWYOXm/wJU9xI4NmBfVrl7XbTbeQnu7RtL8TCLgmsBE6Ut1KyAlC+mEApKnJ8oDaZMveTkL7+yIa5+qxpO5EaW281nbDq7zfsKtfnT7AEwwQF14PETlAbgh8QCzWEwClulsUNjuQIDAQAB"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mail._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.mail_dev_secure_gpo_ca will be created
  + resource "cloudflare_record" "mail_dev_secure_gpo_ca" {
      + allow_overwrite = false
      + content         = "134.122.120.190"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mail.dev.secure.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.mar2019__domainkey_lists_gpo_ca will be created
  + resource "cloudflare_record" "mar2019__domainkey_lists_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=DKIM1;p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDseumw0gBlnJqXmXK14jNzsq73xyCP6fW6eqzs9Z4CdLvvkEzhCX1nL7D9AXTFFgjqw8J4185HAHkzLuPRJ3QqOZWiqOOXmzOG6fHHlxfARp4SHpUQdXaUBMjbjDMxznuMyTFtAqepS5PwHhwmB17ezToB9BUDae7y/fgKwFK79QIDAQAB"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mar2019._domainkey.lists.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.mx_alt1_gpo_ca will be created
  + resource "cloudflare_record" "mx_alt1_gpo_ca" {
      + allow_overwrite = false
      + content         = "ALT1.ASPMX.L.GOOGLE.COM"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gpo.ca"
      + priority        = 5
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.mx_alt2_gpo_ca will be created
  + resource "cloudflare_record" "mx_alt2_gpo_ca" {
      + allow_overwrite = false
      + content         = "ALT2.ASPMX.L.GOOGLE.COM"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gpo.ca"
      + priority        = 5
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.mx_aspmx2_gpo_ca will be created
  + resource "cloudflare_record" "mx_aspmx2_gpo_ca" {
      + allow_overwrite = false
      + content         = "ASPMX2.GOOGLEMAIL.COM"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gpo.ca"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.mx_aspmx3_gpo_ca will be created
  + resource "cloudflare_record" "mx_aspmx3_gpo_ca" {
      + allow_overwrite = false
      + content         = "ASPMX3.GOOGLEMAIL.COM"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gpo.ca"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.mx_aspmx_gpo_ca will be created
  + resource "cloudflare_record" "mx_aspmx_gpo_ca" {
      + allow_overwrite = false
      + content         = "ASPMX.L.GOOGLE.COM"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gpo.ca"
      + priority        = 1
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.o1_list_gpo_ca will be created
  + resource "cloudflare_record" "o1_list_gpo_ca" {
      + allow_overwrite = false
      + content         = "159.183.192.198"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "o1.list.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.return_gpo_ca will be created
  + resource "cloudflare_record" "return_gpo_ca" {
      + allow_overwrite = false
      + content         = "u28200265.wl016.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "return.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.s1__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "s1__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "s1.domainkey.u28235135.wl136.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "s1._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.s2__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "s2__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "s2.domainkey.u28235135.wl136.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "s2._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.scph0219__domainkey_presslist_gpo_ca will be created
  + resource "cloudflare_record" "scph0219__domainkey_presslist_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=DKIM1; k=rsa; h=sha256; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDQkfm5YmOi7e6MNJz3ndVw4SfxLO89xd0PyoTzQX2ZviVY1Fx4TMQjOBaKh622IRpteMscBTHHB1aIzSz5QncCH8qxP8pB6toBmi9DKkEzPF5QQ4d8GcqJND2IqhFCsPJAkc6KGLZWFXW9hsuh04W05NXDZmtnu0MfljIDBb/RawIDAQAB"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "scph0219._domainkey.presslist.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.scph1018__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "scph1018__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=DKIM1; k=rsa; h=sha256; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDHoL0LR9IjrfzaV8bH3gmy4R3cNpjqubv9axTGZR/IG5KbuHxrnpVmRT0+cHsky/xq1s/6XyDciAmXFlE154RcUrLnqWT9kKh30O0a4FsSc8Ur3SzAsh/6CPFKVSxSznM7c6bqSkTNMTB8XuZlp3tNiZ0pFXkUdawFuFOcVCKFEQIDAQAB"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "scph1018._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.scph1018__domainkey_spark_gpo_ca will be created
  + resource "cloudflare_record" "scph1018__domainkey_spark_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=DKIM1; k=rsa; h=sha256; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDVgAwRmison7hL0ECmTLrkJx8Hl6X1KPypmT8PJLsbCW2DwdFN4cz3spMNh54xfgaiCe1lBx95EM+38Jy8kdMaoPZoIMfkf17cPp9kF0VNTwkG31oF7ccUGuj8iyLmOkHCP79yIYjM0zQsMtGxwl6R2n2F+5mE7JPYFnqQl+PBCQIDAQAB"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "scph1018._domainkey.spark.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.secure_apps_gpo_ca will be created
  + resource "cloudflare_record" "secure_apps_gpo_ca" {
      + allow_overwrite = false
      + content         = "143.244.200.166"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "secure.apps.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.secure_auth_gpo_ca will be created
  + resource "cloudflare_record" "secure_auth_gpo_ca" {
      + allow_overwrite = false
      + content         = "143.244.200.166"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "secure.auth.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.sg2__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "sg2__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "sg2.domainkey.u28264590.wl091.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sg2._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.sg__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "sg__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "sg.domainkey.u28264590.wl091.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sg._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.sgr2__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "sgr2__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "sgr2.domainkey.u28200265.wl016.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sgr2._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.sgr__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "sgr__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "sgr.domainkey.u28200265.wl016.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sgr._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.sgw__domainkey_e_gpo_ca will be created
  + resource "cloudflare_record" "sgw__domainkey_e_gpo_ca" {
      + allow_overwrite = false
      + content         = "k=rsa; t=s; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC/jEPkWK1BY2nPk8kB8HT0mR/wA+lSjLQ3MWDKgg/AEsz+vTB7ig5k/Jn7Q2UEh9Y+LGDb3+IK0k56u9fSpX0zHYpc9U2gOi84irplAbf39oMkMq7041SfreV6ENLekLmi0I8wqXiqd+IQpNb7+zduUvLRUsCa8LNFc5hMgewVWwIDAQAB"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sgw._domainkey.e.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.spark_gpo_ca will be created
  + resource "cloudflare_record" "spark_gpo_ca" {
      + allow_overwrite = false
      + content         = "sparkpostmail.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "spark.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.spf_gpo_ca will be created
  + resource "cloudflare_record" "spf_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=spf1 ip4:168.245.17.225 include:_spf.google.com include:helpscoutemail.com ~all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.spf_web_e_gpo_ca will be created
  + resource "cloudflare_record" "spf_web_e_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=spf1 include:sendgrid.net ~all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "web.e.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.staging_gpo_ca will be created
  + resource "cloudflare_record" "staging_gpo_ca" {
      + allow_overwrite = false
      + content         = "137.184.128.54"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "staging.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.staging_secure_gpo_ca will be created
  + resource "cloudflare_record" "staging_secure_gpo_ca" {
      + allow_overwrite = false
      + content         = "137.184.128.54"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "staging.secure.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.strong1__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "strong1__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "strong1._domainkey.helpscout.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "strong1._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.strong2__domainkey_gpo_ca will be created
  + resource "cloudflare_record" "strong2__domainkey_gpo_ca" {
      + allow_overwrite = false
      + content         = "strong2._domainkey.helpscout.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "strong2._domainkey.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.txt_gpo_ca will be destroyed
  # (because cloudflare_record.txt_gpo_ca is not in configuration)
  - resource "cloudflare_record" "txt_gpo_ca" {
      - allow_overwrite = false -> null
      - content         = "v=spf1 ip4:168.245.17.225 include:_spf.google.com include:helpscoutemail.com ~all" -> null
      - created_on      = "2024-12-05T03:43:09.2623Z" -> null
      - hostname        = "gpo.ca" -> null
      - id              = "751d83267138afb6a06ea6b45e1d1626" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-12-05T03:43:09.2623Z" -> null
      - name            = "gpo.ca" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 3600 -> null
      - type            = "TXT" -> null
      - zone_id         = "efca92489a183097b0ac9263110adb7c" -> null
    }

  # cloudflare_record.web_e_gpo_ca will be created
  + resource "cloudflare_record" "web_e_gpo_ca" {
      + allow_overwrite = false
      + content         = "mx.sendgrid.net."
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "web.e.gpo.ca"
      + priority        = 1
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

  # cloudflare_record.www_gpo_ca will be created
  + resource "cloudflare_record" "www_gpo_ca" {
      + allow_overwrite = false
      + content         = "gpo.ca"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "efca92489a183097b0ac9263110adb7c"
    }

Plan: 49 to add, 0 to change, 1 to destroy.
```